/*--------------------------------------------------.
|     **      ******  ********  *******     ****    |
|  **    **  *.          **     **   **   **    **  |
|  **    **     ***.     **     ** ***    **    **  |
|  ********  *      *    **     **   **   **    **  |
|  **    **   ******     **     **   **     ****    |
|---------------------------------------.           |
|          ZONE-01 (cedrick777)         |           |
|---------------------------------------|           |
|  NOM : TOURE Ahmed Christian Cédrick  |           |
|  QUEST 09 : Any                       |           |
'---------------------------------------'----------*/
package piscine

func IsSorted(f func(a, b int) int, tab []int) bool {
	if len(tab)>1 {
		for i := 0; i < len(tab)-1; i++ {
			if !f(i,i+1) {
				return false
			}
		}
		return true
	}else{
		return true
	}	
}